from datetime import time


DAYS_NAME = ['Понедельник','Вторник','Среда','Четверг','Пятница','Суббота','Воскресенье']

SHIFTS = ( (1,3,5,8,9,10,11), (2,4,6,7) ) # классы учащиеся в 1,2 смену
SHIFT = 0 # установил 1 смену, потом хорошо, если бы как-то она определялась сама



#Нормальное расписание
TIMETABLE = {
    (0,): [  # Пн
        [ # 1 смена
            ('Совещание',    time(8,   0), time(8,  15) ),
            ('Классный час', time(8,  15), time(8,  40) ),
            ('1 урок',       time(8,  45), time(9,  25) ),
            ('2 урок',       time(9,  35), time(10, 15) ),
            ('3 урок',       time(10, 30), time(11, 10) ),
            ('4 урок',       time(11, 25), time(12,  5) ),
            ('5 урок',       time(12, 15), time(12, 55) ),
            ('6 урок',       time(13,  5), time(13, 45) ),
            ('7 урок',       time(13, 50), time(14, 35) ),
            ('8 урок',       time(15, 35), time(16, 15) )
	    ],
        [ # 2 смена
            ('Совещание',    time(14, 00), time(14, 10) ),
            ('Классный час', time(14, 10), time(14, 35) ),
            ('1 урок',       time(14, 40), time(15, 20) ),
            ('2 урок',       time(15, 35), time(16, 15) ),
            ('3 урок',       time(16, 25), time(17,  5) ),
            ('4 урок',       time(17, 15), time(17, 55) ),
            ('5 урок',       time(18,  5), time(18, 45) ),
            ('6 урок',       time(18, 50), time(19, 30) )
	    ]
    ],
    (1,2,3,4,): [ # Вт-Пт
        [ # 1 смена
            ('1 урок', time(8,  30), time(9,  15) ),
            ('2 урок', time(9,  25), time(10, 10) ),
            ('3 урок', time(10, 25), time(11, 10) ),
            ('4 урок', time(11, 25), time(12, 10) ),
            ('5 урок', time(12, 20), time(13,  5) ),
            ('6 урок', time(13, 15), time(14,  0) ),
            ('7 урок', time(14, 10), time(14, 50) ),
            ('8 урок', time(15,  5), time(15, 45) )
	    ],
        [ # 2 смена
            ('1 урок', time(14, 10), time(14, 50) ),
            ('2 урок', time(15,  5), time(15, 45) ),
            ('3 урок', time(15, 55), time(16, 35) ),
            ('4 урок', time(16, 45), time(17, 25) ),
            ('5 урок', time(17, 35), time(18, 15) ),
            ('6 урок', time(18, 20), time(19,  0) )
	    ]
    ],
    (5,): [ # Сб
        [ # 1 смена
            ('1 урок', time(8,  30), time(9,  10) ),
            ('2 урок', time(9,  20), time(10, 00) ),
            ('3 урок', time(10, 15), time(10, 55) ),
            ('4 урок', time(11, 10), time(11, 50) ),
            ('5 урок', time(12, 00), time(12, 40) ),
            ('6 урок', time(12, 50), time(13, 30) ),
            ('7 урок', time(13, 40), time(14, 20) ),
            ('8 урок', time(14, 30), time(15, 10) )
	    ],
        [ # 2 смена
            ('уроков нет', time(0, 0), time(23, 59) ),
	    ]
    ],
    (6,):     [ # Вс
        [ # 1 смена
            ('уроков нет', time(0, 0), time(23, 59) ),
	    ],
        [ # 2 смена
            ('уроков нет', time(0, 0), time(23, 59) ),
        ]
    ]
}



SCHEDULE = [
   [ # Понедельник
      ('Совещание',    'Для учителей'),
      ('Классный час', 'Про революцию 1917'),
      ('1 урок',       'Физика (физ-мат) | Химия (хим-био)'),
      ('2 урок',       'Физика (физ-мат) | Химия (хим-био)'),
      ('3 урок',       'Литература'),
      ('4 урок',       'Математика'),
      ('5 урок',       'Математика'),
      ('6 урок',       'География')
   ],
   [ # Вторник
      ('1 урок', 'Химия (физ-мат) | Информатика для (хим-био)'),
      ('2 урок', 'Информатика (физ-мат) | Биология (хим-био)'),
      ('3 урок', 'Информатика (физ-мат) | Биология (хим-био)'),
      ('4 урок', 'ОБЖ'),
      ('5 урок', 'Английский язык'),
      ('6 урок', 'Обществознание'),
      ('7 урок', 'Математика')
    ],
    [ # Среда
      ('1 урок', 'Русский язык'),
      ('2 урок', 'Русский язык'),
      ('3 урок', 'Математика'),
      ('4 урок', 'Математика'),
      ('5 урок', 'Биология (физ-мат) | Физика (хим-био)')
    ],
    [ # Четверг
      ('1 урок', 'Физика (физ-мат) | Химия (хим-био)'),
      ('2 урок', 'Физика (физ-мат) | Химия (хим-био)'),
      ('3 урок', 'История'),
      ('4 урок', 'История'),
      ('5 урок', 'Английский язык (хим-био) | Физика (хим-био)'),
      ('6 урок', 'Искусственный интеллект (физ-мат) | Английский язык (хим-био)')
    ],
    [ # Пятница
      ('1 урок', 'Экология (хим-био)'),
      ('2 урок', 'Физика (физ-мат) | Биология (хим-био)'),
      ('3 урок', 'Физика (физ-мат) | Биология (хим-био)'),
      ('4 урок', 'Математика'),
      ('5 урок', 'Математика'),
      ('6 урок', 'Русский язык'),
      ('7 урок', 'Математика')
    ],
    [ # Суббота
      ('1 урок', 'Информатика (физ-мат)'),
      ('2 урок', 'Информатика (физ-мат)'),
      ('3 урок', 'Литература'),
      ('4 урок', 'Литература'),
      ('5 урок', 'Английский язык')
    ],
    [ # Воскресенье
      ('Весь день', '')
    ]
]
