import command_system
from common_func import keyword_gen

def olimp(keyword=''):
   message = '20.11.2017 - Литература, Физика.\n21.11.2017 - Обществознание.\n22.11.2017 - Математика.\n23.11.2017 - Биология, Информатика и ИКТ.\n24.11.2017 - Русский язык.\n25.11.2017 - Французский язык, География.\n27.11.2017 - Английский язык(Теоретический тур).\n28.11.2017 - Английский язык(Практичесий тур).\n29.11.2017 - Астраномия, История.\n30.11.2017 - Немецкий язык, Право.\n01.12.2017 - МХК, Химия.\n07.12.2017 - Экология, Технология(Теоретические туры).\n08.12.2017 - Экология, Технология(Практические туры).'
   return message, ''

olimp_command = command_system.Command()
olimp_command.keys = keyword_gen('олимпиада', 'олимп')
olimp_command.description = 'Скажу запланированные олимпиады'
olimp_command.process = olimp